apps/food-delivery/test/03-stress-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    # Phase 1: Warm up
    - duration: 60
      arrivalRate: 50
      name: "Phase 1: 50 users/sec (Warm up)"

    # Phase 2: Moderate load
    - duration: 60
      arrivalRate: 100
      name: "Phase 2: 100 users/sec"

    # Phase 3: Heavy load
    - duration: 60
      arrivalRate: 200
      name: "Phase 3: 200 users/sec"

    # Phase 4: Very heavy load
    - duration: 60
      arrivalRate: 500
      name: "Phase 4: 500 users/sec (Breaking point?)"

    # Phase 5: Extreme load
    - duration: 60
      arrivalRate: 1000
      name: "Phase 5: 1000 users/sec (System limit)"

  processor: "./processor.js"

scenarios:
  - name: "Browse Restaurants"
    flow:
      - get:
          url: "/api/restaurants"
      - get:
          url: "/api/restaurants/{{ $randomNumber(1, 20) }}"